КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СобытияОбработчиковПартнеров/КонтурЛогистика_СобытияОбработчиковПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СобытияОбработчиковПартнеров</name>
  <enumValues>
    <name>ПослеЗаполненияТРНт1</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыСопроводительныхДокументов/КонтурЛогистика_ТипыСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыСопроводительныхДокументов</name>
  <enumValues>
    <name>ДокКЗН</name>
  </enumValues>
  <enumValues>
    <name>ДокКТрН</name>
  </enumValues>
  <enumValues>
    <name>ДокКГр</name>
  </enumValues>
  <enumValues>
    <name>ДокПерЦенн</name>
  </enumValues>
  <enumValues>
    <name>СопрВед</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпособыКонвертации/КонтурЛогистика_СпособыКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпособыКонвертации</name>
  <enumValues>
    <name>БезДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВОрганизациюДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПунктМаршрута</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВТранспортноеСредство</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВСотрудника</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВДоговор</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПодразделениеДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВЛицензию</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВГорючеСмазочныйМатериал</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьПоТаблицеСоответствий</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьМассивСтруктур</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СобытияОбработчиковПартнеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает текст подсказок и шаблонов для редактора кода обработчика партнера.
//
// Параметры:
//  Событие - ПеречислениеСсылка.КонтурЛогистика_СобытияОбработчиковПартнеров
//  ИмяРеквизита - Строка - "Условие" или "ТекстОбработкиПослеЗаполнения"
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстШаблоновПодсказок(Событие, ИмяРеквизита = "") Экспорт
	
	Результат = "";
	
	Если Событие = ПослеЗаполненияТРНт1 Тогда
		
		Если ИмяРеквизита = "Условие" Тогда
			Результат = ТекстШаблоновПодсказокУсловияПослеЗаполненияТРНт1();
		Иначе
			Результат = ТекстШаблоновПодсказокОбработкиПослеЗаполненияТРНт1();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстШаблоновПодсказокУсловияПослеЗаполненияТРНт1()
	
	Возврат
	"Доступна переменная Объект - документ КонтурЛогистика_ТрН_Титул1 (после заполнения).
	|Условие должно вернуть Истина или Ложь через РезультатВычисления.
	|Если вернется Истина - будет выполнен обработчик, если Ложь - обработчик не выполнится
	|
	|// Пример: Истина для четного номера ДокументОснование, Ложь для нечетного / если не заполнен
	|РезультатВычисления = Ложь;
	|Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
	|	НомерДокумента = СокрЛП(Строка(Объект.ДокументОснование.Номер));
	|	Попытка
	|		НомерЧислом = Число(НомерДокумента);
	|		РезультатВычисления = (НомерЧислом % 2 = 0);
	|	Исключение
	|		РезультатВычисления = Ложь;
	|	КонецПопытки;
	|КонецЕсли;";
	
КонецФункции

Функция ТекстШаблоновПодсказокОбработкиПослеЗаполненияТРНт1()
	
	Возврат
	"Доступна переменная Объект - документ КонтурЛогистика_ТрН_Титул1 (после заполнения).
	|
	|// Примеры и шаблоны: (скопируй подходящий фрагмент)
	|
	|// Комментарий (или любой другой реквизит этого титула)
	|Объект.Комментарий = ""Текст комментария"";
	|
	|// СрокДоставки в главном документе ЭТРН
	|ДокументЭТРНОбъект = Объект.ДокументЭТРН.ПолучитьОбъект();
	|ДокументЭТРНОбъект.СрокДоставки = ""15.01.2026"";
	|ДокументЭТРНОбъект.Записать();
	|
	|// Сообщить пользователю
	|Сообщить(""Текст сообщения пользователю"");
	|
	|// ИнфПол (информационные поля)
	|Стр = Объект.ИнфПол.Добавить();
	|Стр.Идентиф = ""МОЙКЛЮЧ"";
	|Стр.Значение = ""Значение информационного поля"";
	|
	|// СопрДок (сопроводительные документы, акты, накладные, УПД итд)
	|
	|Стр = Объект.СопроводительныеДокументы.Добавить();
	|Стр.Тип = Перечисления.КонтурЛогистика_ТипыСопроводительныхДокументов.ДокПерЦенн;
	|Стр.ДокументНаименование = ""Акт"";
	|Стр.ДокументНомер = Значение; // например полученное запросом (пример ниже)
	|Стр.ДокументДата = Объект.ДокументОснование.Дата;
	|Стр.ДокументСоставитель = КонтурЛогистика_КонвертацияСерверПовтИсп.СвязанныйОбъектЛогистики(Объект.ДокументОснование, Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок, """");
	|
	|// Запрос
	|Запрос = Новый Запрос;
	|Запрос.Текст = """";
	|Запрос.УстановитьПараметр(""Основание"", Объект.ДокументОснование);
	|Выборка = Запрос.Выполнить().Выбрать();
	|Если Выборка.Следующий() Тогда
	|    Значение = Выборка.Значение;
	|Иначе
	|    Значение = ""-"";
	|КонецЕсли;";
	
КонецФункции

#КонецОбласти

#КонецЕсли
